import { Router } from "express";

export const frequentQuestionsRouter = Router();


// profile routes
frequentQuestionsRouter.get('/', (req, res) => {
    res.status(200).json({ data: [
        {
            "question": "كيف يمكنني الوصول إلى المقالات والمواضيع الدينية على التطبيق؟",
            "response": "يمكنك الوصول إلى المقالات والمواضيع الدينية من خلال قسم المدونات على التطبيق. ستجد مجموعة متنوعة من المقالات التي تغطي مواضيع دينية مختلفة."
        },
        {
            "question": "هل يمكنني تحميل المواد الإعلامية مثل الفيديوهات والصور؟",
            "response": "نعم، يمكنك تحميل المواد الإعلامية مثل الفيديوهات والصور من قسم الوسائط المتعددة. تأكد من مراجعة سياسات الاستخدام قبل تحميل أي مواد."
        },
        {
            "question": "كيف أستطيع تنزيل ملفات PDF من التطبيق؟",
            "response": "يمكنك تنزيل ملفات PDF من قسم الملفات على التطبيق. اختر الملف الذي ترغب في تنزيله واضغط على زر التنزيل."
        },
        {
            "question": "هل يمكنني مشاركة المحتوى من التطبيق عبر وسائل التواصل الاجتماعي؟",
            "response": "نعم، يمكنك مشاركة المحتوى من التطبيق عبر وسائل التواصل الاجتماعي باستخدام خيارات المشاركة المتاحة في كل مقال أو مادة إعلامية."
        },
        {
            "question": "كيف يمكنني البحث عن موضوع معين داخل التطبيق؟",
            "response": "يمكنك البحث عن موضوع معين باستخدام ميزة البحث في التطبيق. اكتب الكلمات المفتاحية في شريط البحث لتجد المقالات والمواد ذات الصلة."
        }
    ]
     });
});

